{"data":{"site":{"siteMetadata":{"title":"Shreya Shankar","author":"Shreya Shankar"}},"markdownRemark":{"id":"a497bf54-66c4-50ed-bace-d17069530908","excerpt":"It’s the dreaded time of the year again - when I go back to school, and some guy I really respect casually mentions how I got my tech internship because I’m a…","html":"<p>It’s the dreaded time of the year again - when I go back to school, and some guy I really respect casually mentions how I got my tech internship because I’m a girl. Or when career fair time rolls around and recruiters take one look at my face and hand me a different flyer that advertises their diversity program. Or when some talented male freshman who has been programming since he was 10 scoffs that he can’t get an internship at Google or Facebook, saying ”[he] could have easily gotten it if [he] was a girl.”</p>\n<p>I’m grateful for for the opportunities I receive, but I can’t help feeling bummed when I hear these comments. As a diversity program participant, I know it sucks to feel like a pawn in the game of affirmative action, sacrificing my feelings for future women in tech to enter a level playing field. Get over it! Many of my female mentors and role models have advised. You’re qualified! You’re smart! And you did a “real” software engineering internship at Facebook!</p>\n<p>But hearing this does not fix the problem. As an underclassman female CS major, once the first few guys doubted my technical qualifications, I began to wonder if all my male friends felt the same way. Maybe they didn’t voice it out loud because they wanted to be tactful. There weren’t any older female CS majors that I could talk to about how I felt - mainly because these diversity programs are so new, and my class is one of the first few waves of diversity program participants.</p>\n<p>I’m grateful that I have a lot of close male friends who support me as a woman. But every time I hear some insensitive comment from someone else about diversity programs during recruiting season, here’s the two-sided dialogue that goes through my head, as I contemplate what to say to fight centuries of sexism.</p>\n<hr>\n<p><em>He’s probably right. Even if guys are nice and smart, they don’t get internships at large companies after freshman year.</em></p>\n<p>Wrong! By being a woman and minority in tech, you’ve probably had to overcome so many more obstacles, like stereotype threat, to get to this same place that he has. Just by showing up to the career fair, you’ve challenged the stereotype of a CS student. By taking CS classes, you’ve gone outside of your comfort zone to pursue a field that has few role models that look like you. That guy who made the comment feels entitled to an internship, while you feel like you’re not good enough. That speaks for itself.</p>\n<p><em>I’m not as technically qualified for an internship as he is.</em></p>\n<p>A little-known secret: the core CS class sequence at many schools is way more than enough for several upperclassman internships. Freshman and sophomore programs assume only a few CS classes. After a certain level, additional knowledge isn’t required. Reality is, you are way more qualified for the position than you think. And the fact that you’re different is a bonus - by hiring you, companies get a maximally different perspective.</p>\n<p><em>I don’t even know if I like CS; how do I deserve this more than him?</em></p>\n<p>Who knows who deserves the position more. Does it matter? Statistically, he is <a href=\"http://newsroom.ucla.edu/stories/cracking-the-code:-why-aren-t-more-women-majoring-in-computer-science\">more likely to complete the CS major</a> and get a full-time software engineering offer, regardless of how many internships he has done. Women on the other hand <a href=\"https://3zjc852t4swp1lmezl171oga-wpengine.netdna-ssl.com/wp-content/uploads/2016/10/Accenture-Cracking-The-Gender-Code-Report.pdf\">drop out of CS</a> because they don’t have many relatable role models or a strong sense of community like majority of men do. An internship is more likely to help you decide whether you like it or not so you can see yourself as a full-time software engineer. You deserve this chance.</p>\n<p><em>Everyone will continue to look at me as a “diversity hire,” even later on.</em></p>\n<p>When I showed up to Facebook, a lot of people outside my team asked me if I participated in Facebook’s diversity program, FBU. Maybe they had never seen a rising junior female software engineering intern who didn’t participate in FBU. But we’re clearly technically qualified, because we successfully work on impactful projects.</p>\n<p><em>Did I actually get this because I’m a girl?</em></p>\n<p>Ah, the question everyone squirms away from, trying to console you with a variation of the answers above. Here’s the real deal: nobody knows. There are too many variables involved in the internship or job hunt. But to get a return or full-time offer, you have to be as technically qualified as everyone else while justifying your ability as a female programmer to everyone that doubts you for your looks. Most guys don’t have to do that.</p>\n<hr>\n<p>After this internal back-and-forth, I still don’t have a concise, convincing answer. I sigh and respond. “You could be right,” I usually concede. “We’re fighting historical oppression of females in tech. But we’ll all end up with jobs in this industry anyways.”</p>\n<p>He isn’t satisfied, but he has nothing more to say. Meanwhile, I’m raging internally, wishing I stood up for women like me. But I don’t want to offend him, because he’s most likely a friend or well-respected by my peers. Feeling like a failed feminist, I trudge back home to add a new, challenging CS course to my study list or start a technical side project to justify my self-worth.</p>","frontmatter":{"title":"You got this because you're a girl.","date":"September 15, 2017","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/you-got-this/","previous":{"fields":{"slug":"/taylor-swift-ai/"},"frontmatter":{"title":"Taylor Swift vs Artificial Intelligence - Who's Better?"}},"next":{"fields":{"slug":"/ai-for-everyone/"},"frontmatter":{"title":"AI for Everyone: Things to Consider when Experimenting"}}}}